Table of Contents
 Class ConcreteULSCheckResultDiagramCapacity
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
ULS Check Diagram Capacity base
public abstract class ConcreteULSCheckResultDiagramCapacity : ConcreteCheckResultBase
Inheritance
object
ConcreteCheckResultBase
ConcreteULSCheckResultDiagramCapacity
Derived
ConcreteULSCheckResultDiagramCapacityEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CheckMethod
method of check
public IntDiagCheckMethod CheckMethod { get; set; }
Property Value
IntDiagCheckMethod
 Fu
calculated ultimate internal forces
public ResultOfInternalForces Fu { get; set; }
Property Value
ResultOfInternalForces
 Fu1
calculated ultimate internal forces
public ResultOfInternalForces Fu1 { get; set; }
Property Value
ResultOfInternalForces
 Fu2
calculated ultimate internal forces
public ResultOfInternalForces Fu2 { get; set; }
Property Value
ResultOfInternalForces
 Edit this page